src/InformationRegisters/ИсторияЗапросовВерсийХранилища/ИсторияЗапросовВерсийХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЗапросовВерсийХранилища</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ВПроцессе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписиУниверсальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИсторияЗапросовВерсийХранилища/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ДобавитьСобытие(ИнформационнаяБаза, Операция, ДопПараметры) Экспорт
	Запись = РегистрыСведений.ИсторияЗапросовВерсийХранилища.СоздатьМенеджерЗаписи();
	Если ДопПараметры<>Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Запись, ДопПараметры);
	КонецЕсли;
	Запись.ДатаЗаписиУниверсальная = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Запись.Период = ТекущаяДатаСеанса();
	Если Не ЗначениеЗаполнено(Запись.Пользователь) Тогда
		Запись.Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Запись.ИнформационнаяБаза = ИнформационнаяБаза;
	Запись.Операция = Операция;
	
	Запись.Записать();
	Возврат Запись;
КонецФункции

Процедура ЗакончитьСобытие(Рег, Комментарий="", Ошибка=Ложь) Экспорт
	Рег.Длительность = ТекущаяДатаСеанса() - Рег.Период;
	Рег.ВПроцессе = Ложь;
	Рег.Ошибка = Ошибка;
	Рег.ТекстОшибки = Комментарий;
	Рег.Записать();
КонецПроцедуры	

Процедура ОчисткаУстаревшихДанных(СколькоДнейОставить = 14) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Рег.ВерсияХранилища КАК ВерсияХранилища,
		|	Рег.ДатаЗаписиУниверсальная КАК ДатаЗаписиУниверсальная
		|ИЗ
		|	РегистрСведений.ИсторияЗапросовВерсийХранилища КАК Рег
		|ГДЕ
		|	Рег.Период < &День
		|
		|УПОРЯДОЧИТЬ ПО
		|	Рег.ДатаЗаписиУниверсальная";
	Запрос.УстановитьПараметр("День", НачалоДня(ТекущаяДата()-СколькоДнейОставить*24*3600));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ластик = РегистрыСведений.ИсторияЗапросовВерсийХранилища.СоздатьНаборЗаписей();
		Ластик.Отбор.ВерсияХранилища.Установить(Выборка.ВерсияХранилища);
		Ластик.Отбор.ДатаЗаписиУниверсальная.Установить(Выборка.ДатаЗаписиУниверсальная);
		Ластик.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
